CACHE_START_DATE = "2020-01-01"
SELECTED_STRATEGY = "maps"
MARKET_REGIME_FILTER_TICKER_MAIN = "^GSPC"
MARKET_REGIME_FILTER_TICKERS_AUX = ["^IXIC", "NQ=F", "^DJI"]
MARKET_REGIME_FILTER_COUNTRY = "us"
MARKET_REGIME_FILTER_DELAY_DAY = 1
MARKET_REGIME_FILTER_MA_PERIOD = 50
MARKET_REGIME_RISK_OFF_EQUITY_RATIO = 70


# MARKET_REGIME_FILTER_MA_PERIOD = 41
# MARKET_REGIME_RISK_OFF_EQUITY_RATIO = 100
# ========= 백테스트 결과 요약 ==========
# | 기간: 2024-10-10 ~ 2025-10-10 (12 개월)
# | 투자 축소(100% 투자): 2024-11-01 ~ 2024-11-01 (1 거래일)
# | 투자 축소(100% 투자): 2024-11-05 ~ 2024-11-05 (1 거래일)
# | 투자 축소(100% 투자): 2024-12-19 ~ 2024-12-23 (5 거래일)
# | 투자 축소(100% 투자): 2025-01-02 ~ 2025-01-09 (8 거래일)
# | 투자 축소(100% 투자): 2025-01-13 ~ 2025-01-17 (5 거래일)
# | 투자 축소(100% 투자): 2025-02-25 ~ 2025-04-18 (53 거래일)
# | 투자 축소(100% 투자): 2025-04-22 ~ 2025-04-29 (8 거래일)
# | 초기 자본: 1억원
# | 최종 자산: 1억 6,545만원
# | 누적 수익률: +65.46%
# | 벤치마크
# | 1. Kodex 미국S&P500(379800): +22.67%
# | 2. TIMEFOLIO 미국나스닥100액티브(426030): +75.73%
# | CAGR (연간 복리 성장률): +65.51%
# | 벤치마크 CAGR
# | 1. Kodex 미국S&P500(379800): +22.68%
# | 2. TIMEFOLIO 미국나스닥100액티브(426030): +75.80%
# | MDD (최대 낙폭): -20.43%
# | Sharpe Ratio: 2.26
# | Sortino Ratio: 3.29
# | Calmar Ratio: 3.21
# | Ulcer Index: 5.11
# | CUI (Calmar/Ulcer): 0.63

# MARKET_REGIME_FILTER_MA_PERIOD = 41
# MARKET_REGIME_RISK_OFF_EQUITY_RATIO = 90
# ========= 백테스트 결과 요약 ==========
# | 기간: 2024-10-10 ~ 2025-10-10 (12 개월)
# | 투자 축소(90% 투자): 2024-11-01 ~ 2024-11-01 (1 거래일)
# | 투자 축소(90% 투자): 2024-11-05 ~ 2024-11-05 (1 거래일)
# | 투자 축소(90% 투자): 2024-12-19 ~ 2024-12-23 (5 거래일)
# | 투자 축소(90% 투자): 2025-01-02 ~ 2025-01-09 (8 거래일)
# | 투자 축소(90% 투자): 2025-01-13 ~ 2025-01-17 (5 거래일)
# | 투자 축소(90% 투자): 2025-02-25 ~ 2025-04-18 (53 거래일)
# | 투자 축소(90% 투자): 2025-04-22 ~ 2025-04-29 (8 거래일)
# | 초기 자본: 1억원
# | 최종 자산: 1억 6,365만원
# | 누적 수익률: +63.66%
# | 벤치마크
# | 1. Kodex 미국S&P500(379800): +22.67%
# | 2. TIMEFOLIO 미국나스닥100액티브(426030): +75.73%
# | CAGR (연간 복리 성장률): +63.71%
# | 벤치마크 CAGR
# | 1. Kodex 미국S&P500(379800): +22.68%
# | 2. TIMEFOLIO 미국나스닥100액티브(426030): +75.80%
# | MDD (최대 낙폭): -19.67%
# | Sharpe Ratio: 2.27
# | Sortino Ratio: 3.36
# | Calmar Ratio: 3.24
# | Ulcer Index: 5.06
# | CUI (Calmar/Ulcer): 0.64

# MARKET_REGIME_FILTER_MA_PERIOD = 41
# MARKET_REGIME_RISK_OFF_EQUITY_RATIO = 0
# ========= 백테스트 결과 요약 ==========
# | 기간: 2024-10-10 ~ 2025-10-10 (12 개월)
# | 투자 축소(0% 투자): 2024-11-01 ~ 2024-11-01 (1 거래일)
# | 투자 축소(0% 투자): 2024-11-05 ~ 2024-11-05 (1 거래일)
# | 투자 축소(0% 투자): 2024-12-19 ~ 2024-12-23 (5 거래일)
# | 투자 축소(0% 투자): 2025-01-02 ~ 2025-01-09 (8 거래일)
# | 투자 축소(0% 투자): 2025-01-13 ~ 2025-01-17 (5 거래일)
# | 투자 축소(0% 투자): 2025-02-25 ~ 2025-04-18 (53 거래일)
# | 투자 축소(0% 투자): 2025-04-22 ~ 2025-04-29 (8 거래일)
# | 초기 자본: 1억원
# | 최종 자산: 1억 6,730만원
# | 누적 수익률: +67.31%
# | 벤치마크
# | 1. Kodex 미국S&P500(379800): +22.67%
# | 2. TIMEFOLIO 미국나스닥100액티브(426030): +75.73%
# | CAGR (연간 복리 성장률): +67.36%
# | 벤치마크 CAGR
# | 1. Kodex 미국S&P500(379800): +22.68%
# | 2. TIMEFOLIO 미국나스닥100액티브(426030): +75.80%
# | MDD (최대 낙폭): -9.18%
# | Sharpe Ratio: 2.93
# | Sortino Ratio: 4.61
# | Calmar Ratio: 7.34
# | Ulcer Index: 3.35
# | CUI (Calmar/Ulcer): 2.19
